#+TITLE: Dados: O PIB da pandemia e cenários para 2021
#+DATE: Janeiro de 2021
#+LATEX_CLASS: SelfArx
#+SETUPFILE: ../manuscript.setup
#+INCLUDE: Infos.org
#+PROPERTY: header-args python :results output drawer :eval never-export :session Cecon
#+PROPERTY: header-args R :results output drawer :eval never-export :session Cecon
#+LATEX:\flushbottom % Makes all text pages the same height
#+LATEX:\maketitle % Print the title and abstract box
#+LATEX:\thispagestyle{empty} % Removes page numbering from the first page
#+LATEX: \onecolumn
#+LATEX_HEADER: \usepackage{multirow, numprint}
bibliography:refs.bib

** Python
#+BEGIN_SRC python
import pandas as pd
import numpy as np
from datetime import datetime as dt
from datetime import timedelta

from tabulate import tabulate

import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
from matplotlib.ticker import FuncFormatter

import seaborn as sns
import pandas_datareader.data as web
import requests
import json

import matplotlib.dates as mdates

import country_converter as coco

cc = coco.CountryConverter()

import matplotlib.image as image

logo = "./figs/Cecon_Logo.png"
logo = image.imread(logo)
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
corona_sp = "2020-03-24"
corona_sp_txt = "Início isolamento social em SP"

corona_60 = "2020-03-18"
corona_60_txt = "Mais de 60 casos de COVID-19"

start_year = "2018-01-01"
base = "2014-12-01"


def line_format(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    if month == "Jan":
        month += f"\n{label.year}"
    return month


# ax.set_xticklabels(map(lambda x: line_format(x), df[start_year:].index))


def line_format_day(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    day = label.day
    string = f"{day}/{month}"
    return month


def interpolator(df):
    for col in df:
        df[col] = pd.to_numeric(df[col], errors="coerce")
        df = df.resample("D").interpolate(method="time")

    return df


def line_format(label):
    """
    Convert time label to the format of pandas line plot
    """
    month = label.month_name()[:3]
    if month == "Jan":
        month += f"\n{label.year}"
    return month


def rebase(df, base=base):
    for col in df:
        df[col] = df[col].apply(lambda x: (100 * x) / df[col][base])
    return df


def consulta_bc(codigo_bcb, nome=["Nome da série"]):
    url = "http://api.bcb.gov.br/dados/serie/bcdata.sgs.{}/dados?formato=json".format(
        codigo_bcb
    )
    df = pd.read_json(url)
    df["data"] = pd.to_datetime(df["data"], dayfirst=True)
    df.set_index("data", inplace=True)
    df.index.name = ""
    df.columns = nome
    return df


def autolabel(rects):
    """
    Attach a text label above each bar displaying its height
    """
    for rect in rects:
        height = rect.get_height()
        ax.text(
            rect.get_x() + rect.get_width() / 2.0,
            1.05 * height,
            "%d" % int(height),
            ha="center",
            va="bottom",
        )


def add_value_labels(ax, spacing=5):
    """Add labels to the end of each bar in a bar chart.

    Arguments:
        ax (matplotlib.axes.Axes): The matplotlib object containing the axes
            of the plot to annotate.
        spacing (int): The distance between the labels and the bars.
    """

    # For each bar: Place a label
    for rect in ax.patches:
        # Get X and Y placement of label from rect.
        y_value = rect.get_height()
        x_value = rect.get_x() + rect.get_width() / 2

        # Number of points between bar and label. Change to your liking.
        space = spacing
        # Vertical alignment for positive values
        va = "bottom"

        # If value of bar is negative: Place label below bar
        if y_value < 0:
            # Invert space to place label below
            space *= -1
            # Vertically align label at top
            va = "top"

        # Use Y value as label and format number with one decimal place
        label = "{:.1f}".format(y_value)

        # Create annotation
        ax.annotate(
            label,  # Use `label` as label
            (x_value, y_value),  # Place label at end of the bar
            xytext=(0, space),  # Vertically shift label by `space`
            textcoords="offset points",  # Interpret `xytext` as offset in points
            ha="center",  # Horizontally center label
            va=va,
        )  # Vertically align label differently for
        # positive and negative values.
#+END_SRC

#+RESULTS:
:results:
:end:
** R

#+begin_src R
library(sidrar)
library(tidyverse)
library(xlsx)
## library(data.table)
## library(dtplyr)
## library(dplyr, warn.conflicts = FALSE)
library(cowplot)
logo_file <- './figs/Cecon_Logo.png'
source('https://gist.githubusercontent.com/benmarwick/2a1bb0133ff568cbe28d/raw/fb53bd97121f7f9ce947837ef1a4c65a73bffb3f/geom_flat_violin.R')

library(patchwork)
                                        # funçãozinha dos esquemas --------------------------------------------------------------------

gen_poly <- function(x, .deg=3) {
  options(na.action="na.exclude")
  t <- 1:length(x)
  fit <- lm(x ~ poly(t, degree = .deg))
  pred <- predict(fit, data.frame(t = t))
  return(pred)
}


                                        # aplica na baguia toda -----------------------------------------------------------------------

deg <- 5 # degree do poly

argmax <- function(smoothed, w=1, ...) {
  require(zoo)
  n <- length(smoothed)
  smoothed <- zoo(smoothed)
  y.max <- rollapply(smoothed, 2*w+1, max, align="center")
  delta <- y.max - smoothed[-c(1:w, n+1-1:w)]
  i.max <- which(delta <= 0) + w
  return(i.max)
}

ggthemr::ggthemr('pale')
#+end_src

#+RESULTS:
:results:
── [1mAttaching packages[22m ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse 1.3.0 ──
[32m✔[39m [34mggplot2[39m 3.3.3     [32m✔[39m [34mpurrr  [39m 0.3.4
[32m✔[39m [34mtibble [39m 3.1.0     [32m✔[39m [34mdplyr  [39m 1.0.5
[32m✔[39m [34mtidyr  [39m 1.1.2     [32m✔[39m [34mstringr[39m 1.4.0
[32m✔[39m [34mreadr  [39m 1.4.0     [32m✔[39m [34mforcats[39m 0.5.0
── [1mConflicts[22m ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
[31m✖[39m [34mdplyr[39m::[32mfilter()[39m masks [34mstats[39m::filter()
[31m✖[39m [34mdplyr[39m::[32mlag()[39m    masks [34mstats[39m::lag()

Attaching package: ‘patchwork’

The following object is masked from ‘package:cowplot’:

    align_plots
:end:
*** Google mobility

#+begin_src sh :dir /HDD/Cecon_Atividade/Nota_016/ :exports none

wget -O ./raw/Covid/Google_Mobility.csv https://www.gstatic.com/covid19/mobility/Global_Mobility_Report.csv
#+end_src

#+RESULTS:
:results:
Erro: unexpected symbol in "wget -O ."
:end:

*** Brasil.io

#+begin_src sh :dir /HDD/Cecon_Atividade/Nota_016/ :exports none
wget -O ./raw/Covid/Casos_Brasilio.csv.gz https://data.brasil.io/dataset/covid19/caso_full.csv.gz
gunzip ./raw/Covid/Casos_Brasilio.csv.gz
#+end_src

#+RESULTS:
:results:
Erro: unexpected symbol in "wget -O ."
Erro: unexpected symbol in "gunzip ."
:end:

*** Baixando :noexport:

#+begin_src shell :dir /HDD/Cecon_Atividade/Nota_016/raw/Granulares/ :exports none
wget -N https://raw.githubusercontent.com/ActiveConclusion/COVID19_mobility/master/google_reports/mobility_report_brazil.csv
#+end_src

#+RESULTS:
:results:
:end:

** Baixando dados e criando nomes :ignore:
#+BEGIN_SRC sh :dir ./raw/ContasNacionais/ :exports none :eval no
wget -N --backups=1 ftp://ftp.ibge.gov.br/Contas_Nacionais/Contas_Nacionais_Trimestrais/Tabelas_Completas/Tab_Compl_CNT.zip
unzip -o Tab_Compl_CNT.zip
mv *.xls Tab_Compl_CNT.xlsx
#+END_SRC

#+BEGIN_SRC python
Colunas = [
    "Agropecuaria",
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria",
    "Comercio",
    "Transporte, armazenagem e correio",
    "Informacao e comunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
    "VA",
    "PIB",
    "Consumo das Familias",
    "Consumo do Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Agropecuaria = ['Agropecuaria']

Industria = [
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria"
]

Servicos = [
    "Comercio",
    "Transporte, armazenagem e correio",
    "Informacao e comunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
]

Demanda = [
    "Consumo das Familias",
    "Consumo do Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Oferta = [
    'Agropecuaria',
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel('./raw/ContasNacionais/Tab_Compl_CNT.xlsx', header=3, sheet_name='Val encad preços 95 com ajuste', index_col=0)
df.index = df.index.str.replace('.', 'Q').str.replace('IV', '4').str.replace('III', '3').str.replace('II', '2').str.replace('I', '1')
df.index = pd.PeriodIndex(df.index, freq='Q')
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
#+END_SRC

#+RESULTS:
:results:
:end:

*** Carregano dados :ignore:

#+BEGIN_SRC python :exports none
Colunas = [
    "Agropecuaria",
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria",
    "Comercio",
    "Transporte, armazenagem\ne correio",
    "Informacao e\ncomunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
    "VA",
    "Imposto",
    "PIB",
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Agropecuaria = ['Agropecuaria']

Industria = [
    "Industria Extrativa",
    "Industria de Transformacao",
    "Eletricidade e agua",
    "Construcao",
    "Total Industria"
]

Servicos = [
    "Comercio",
    "Transporte, armazenagem\ne correio",
    "Informacao e\ncomunicacao",
    "Atividades Financeiras",
    "Atividades Imobiliarias",
    "Outras atividades",
    "ADM, defesa, etc",
    "Total Servicos",
]

Demanda = [
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao"
]

Oferta = [
    'Agropecuaria',
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel('./raw/ContasNacionais/Tab_Compl_CNT.xlsx', header=3, sheet_name='Acum. em 4 trimestres', index_col=0)
df.index = df.index.str.replace('.', 'Q').str.replace('IV', '4').str.replace('III', '3').str.replace('II', '2').str.replace('I', '1')
df.index = pd.PeriodIndex(df.index, freq='Q')
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
#+END_SRC

#+RESULTS:
:results:
:end:

*** PIB

#+BEGIN_SRC python :exports none
Colunas = [
    "Agropecuária",
    "Ind. Extrativa",
    "Ind. de Transformação",
    "Eletricidade e gás, água,esgoto,\nativ. de gestão de resíduos",
    "Construção",
    "Total Industria",
    "Comércio",
    "Transporte, armazenagem\ne correio",
    "Informação e\ncomunicação",
    "Ativ. Financeiras, de seguros e\nserviços relacionados",
    "Ativ. Imobiliárias",
    "Outras atividades de serviços",
    "Adm., defesa, saúde e educação\npúblicas e seguridade social",
    "Total Servicos",
    "VA",
    "Imposto",
    "PIB",
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao",
]

Agropecuaria = ["Agropecuária"]

Industria = [
    "Ind. Extrativa",
    "Ind. de Transformação",
    "Eletricidade e gás, água,esgoto,\nativ. de gestão de resíduos",
    "Construção",
    # "Total Industria",
]

Servicos = [
    "Comércio",
    "Transporte, armazenagem\ne correio",
    "Informação e\ncomunicação",
    "Ativ. Financeiras, de seguros e\nserviços relacionados",
    "Ativ. Imobiliárias",
    "Outras atividades de serviços",
    "Adm., defesa, saúde e educação\npúblicas e seguridade social",
    # "Total Servicos",
]

Demanda = [
    "Consumo\ndas Familias",
    "Consumo\ndo Governo",
    "FBCF",
    "Exportacao",
    "Importacao",
]

Oferta = [
    "Agropecuaria",
    "Total Industria",
    "Total Servicos",
]

df = pd.read_excel(
    "./raw/ContasNacionais/Tab_Compl_CNT.xlsx",
    header=3,
    sheet_name="Acum. em 4 trimestres",
    index_col=0,
)
df.index = (
    df.index.str.replace(".", "Q")
    .str.replace("IV", "4")
    .str.replace("III", "3")
    .str.replace("II", "2")
    .str.replace("I", "1")
)
df.index = pd.PeriodIndex(df.index, freq="Q")
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
#+END_SRC

#+RESULTS:
:results:
:end:

#+BEGIN_SRC python :results graphics file :file ./figs/PIB/PIB_Acum.pdf
df = pd.read_excel(
    "./raw/ContasNacionais/Tab_Compl_CNT.xlsx",
    header=3,
    sheet_name="Acum. em 4 trimestres",
    index_col=0,
)
df.index = (
    df.index.str.replace(".", "Q")
    .str.replace("IV", "4")
    .str.replace("III", "3")
    .str.replace("II", "2")
    .str.replace("I", "1")
)
df.index = pd.PeriodIndex(df.index, freq="Q")
df.columns = Colunas
df["Importacao"] = -df["Importacao"]
df.index = df.index.to_timestamp()
last = str(df.index.to_list()[-1]).split(" ")[0]
df = (
    df[last:][Servicos + Industria + Agropecuaria + ["PIB"]]
    .transpose()
    .sort_values("2020-10-01", ascending=False)
)


colors = "".join(["r" if col == "PIB" else "b" for col in df.index])

fig, ax = plt.subplots(figsize=(8, 5))
df.plot(
    title=f"Taxa (%) acumulada no ano em relação ao\nmesmo período do ano anterior",
    ax=ax,
    lw=1.5,
    legend=False,
    kind="bar",
    edgecolor="black",
    width=0.8,
    color=colors,
)
ax.set_yticklabels(["{:,.0%}".format(x / 100) for x in ax.get_yticks()])
ax.axhline(y=0, ls="-", lw=1.0, color="black")

add_value_labels(ax)

ax2 = plt.axes([0.1375, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/PIB/PIB_Acum" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0.2,
)
#+END_SRC

#+RESULTS:
[[file:./figs/PIB/PIB_Acum.pdf]]

* Crédito
#+begin_src python
start_year = '2019-01-01'
#+end_src

#+RESULTS:
:results:
:end:

*** Volume com ajuste sazonal


#+begin_src R :exports none
df <- get_sidra(
  api = "/t/6443/n1/all/v/8677/p/all/c11046/40312/c12355/31399,31426,106869,106874,106876,107071/d/v8677%201"
) %>%
  select( "Mês (Código)", "Atividades de serviços", "Valor") %>%
  mutate(Data =  paste0(`Mês (Código)`, "01")) %>%
  mutate(Data = as.Date(Data, format="%Y%m%d")) %>%
  select(-c(`Mês (Código)`)) %>%
  pivot_wider(names_from = "Atividades de serviços", values_from = Valor)

names(df) <- c(
  "Data",
  "Profissionais, Administrativos e Complementares",
  "Outros",
  "Prestados às famílias",
  "Informação e comunicação",
  "Transportes, Serviços auxiliares e Correio",
  "Total"
  )
write.csv(
  df,
  './clean/IBGE/PMS_volume_dessazonalizada.csv',
  row.names=FALSE
)
#+end_src

#+RESULTS:
:results:
All others arguments are desconsidered when 'api' is informed
:end:

#+BEGIN_SRC python  :results graphics file :file ./figs/Setoriais/PMS_vol_dessazonalizada.pdf
df = pd.read_csv(
    "./clean/IBGE/PMS_volume_dessazonalizada.csv", index_col="Data", parse_dates=True
)

df.index.name = ""

for col in df:
    df[col] = df[col].apply(lambda x: (100 * x) / df[col].loc[base])

df = df[start_year:]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8, 5))
df.plot(
    title=f"Pesquisa Mensal de Serviços (PMS)\nÍndice de Volume de serviços dessazonalizado\n{base} = 100",
    ax=ax,
    lw=2.5,
)
ax.axvline(x=corona_sp, color="black", ls="--", lw=1, label="Início isolamento em SP")
ax.legend(loc="center left", bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/Setoriais/PMS_vol_dessazonalizada" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0.2,
)
#+END_SRC

#+RESULTS:
[[file:./figs/Setoriais/PMS_vol_dessazonalizada.pdf]]

*** Volume com ajuste sazonal (em relação ao mês anterior)


#+begin_src R :exports none
df <- get_sidra(
  api = "/t/6443/n1/all/v/8677/p/all/c11046/40312/c12355/31399,31426,106869,106874,106876,107071/d/v8677%201"
) %>%
  select( "Mês (Código)", "Atividades de serviços", "Valor") %>%
  mutate(Data =  paste0(`Mês (Código)`, "01")) %>%
  mutate(Data = as.Date(Data, format="%Y%m%d")) %>%
  select(-c(`Mês (Código)`)) %>%
  pivot_wider(names_from = "Atividades de serviços", values_from = Valor)

names(df) <- c(
  "Data",
  "Profissionais, Administrativos e Complementares",
  "Outros",
  "Prestados às famílias",
  "Informação e comunicação",
  "Transportes, Serviços auxiliares e Correio",
  "Total"
  )
write.csv(
  df,
  './clean/IBGE/PMS_volume_dessazonalizada.csv',
  row.names=FALSE
)
#+end_src

#+RESULTS:
:results:
All others arguments are desconsidered when 'api' is informed
:end:

#+BEGIN_SRC python  :results graphics file :file ./figs/Setoriais/PMS_vol_dessazonalizada_diff.pdf
df = pd.read_csv(
    "./clean/IBGE/PMS_volume_dessazonalizada.csv", index_col="Data", parse_dates=True
)

df.index.name = ""

for col in df:
    df[col] = df[col].apply(lambda x: (100 * x) / df[col].loc[base])

df = df["2020-01-01":]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8, 5))
df.diff().plot(
    title=f"Pesquisa Mensal de Serviços (PMS)\nÍndice de Volume de serviços dessazonalizado\nComparado ao mês anterior",
    ax=ax,
    lw=2.5,
)
ax.axvline(x=corona_sp, color="black", ls="--", lw=1, label="Início isolamento em SP")
ax.axhline(y=0, color="black", ls="-", lw=1)
ax.legend(loc="center left", bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135, 0.135, 0.2, 0.2])
ax2.imshow(logo, aspect="auto", zorder=0, alpha=0.5)
ax2.axis("off")

sns.despine()
plt.close()

fig.savefig(
    "./figs/Setoriais/PMS_vol_dessazonalizada_diff" + ".pdf",
    dpi=300,
    bbox_inches="tight",
    pad_inches=0.2,
)
#+END_SRC

#+RESULTS:
[[file:./figs/Setoriais/PMS_vol_dessazonalizada_diff.pdf]]

** Rendimento habitual médio por atividade


#+BEGIN_SRC python   :tangle ./codes/pnad.py :eval no
df = pd.read_excel(
    file_path,
    sheet_name = "Brasil Mensal RHM Setor Real",
    skiprows = 11,
    usecols = "A:K",
    parse_date = True,
    index_col = [0]
)
df.index.name = ''
df = df[start_year:]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8,5))
df.plot(
    title = "Rendimento habitual médio por atividade",
    ax = ax,
    lw = 2.5
)
ax.axvline(x = corona_sp, color='black', ls='--', lw=1, label='Início isolamento social em SP')
ax.legend(loc='center left', bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135,0.135,0.2,0.2])
ax2.imshow(logo, aspect='auto', zorder=0, alpha=.5)
ax2.axis('off')

sns.despine()
plt.close()

fig.savefig(
    image_path + file_path.strip("/")[-1] + "RHM_Setor" + "_" + '.pdf',
    dpi = 300, 
    bbox_inches='tight',pad_inches=0
    )
#+END_SRC

#+RESULTS:
:results:
:end:

** Desalentados e subocupados :noexport:

#+BEGIN_SRC python   :tangle ./codes/pnad.py :eval no
var = "Desalentados_Subocupados"
df = pd.read_excel(
    file_path,
    sheet_name = "Brasil Dessaz",
    skiprows = 11,
    usecols = "A,D,S,T",
    parse_date = True,
    index_col = [0]
)
df.index.name = ''
df.columns = [
    "Força de trabalho",
    "Subocupados",
    "Desalentados"
]
df = df.apply(pd.to_numeric, errors='coerce')
df["Taxa de desalentados"] = df["Desalentados"]/df["Força de trabalho"]
df["Taxa de Subocupados por \ninsuficiência de horas trabalhadas"] = df["Subocupados"]/df["Força de trabalho"]
df = df[start_year:]
df = df[["Taxa de desalentados", "Taxa de Subocupados por \ninsuficiência de horas trabalhadas"]]
df = interpolator(df)

fig, ax = plt.subplots(figsize=(8,5))
df.plot(
    title = "Taxa de desalentados e subocupatos\n(em % da força de trabalho)",
    ax = ax,
    lw = 2.5
)
ax.axvline(x = corona_sp, color='black', ls='--', lw=1, label='Início isolamento social em SP')
ax.legend(loc='center left', bbox_to_anchor=(1, 0.5))
ax2 = plt.axes([0.135,0.135,0.2,0.2])
ax2.imshow(logo, aspect='auto', zorder=0, alpha=.5)
ax2.axis('off')

sns.despine()
plt.close()

fig.savefig(
    image_path + file_path.strip("/")[-1] + var.replace(" ", "_") + "_" + '.pdf',
    dpi = 300,
    bbox_inches='tight',pad_inches=0
    )
#+END_SRC

#+RESULTS:
:results:
:end:

*** Our world data

#+BEGIN_SRC python
df = pd.read_csv(
    "https://raw.githubusercontent.com/owid/covid-19-data/master/public/data/owid-covid-data.csv",
    index_col="date",
    parse_dates=True,
    usecols=[  # subseting
        "date",
        "iso_code",
        "continent",
        "total_cases",
        "total_deaths",
        "total_cases_per_million",
        "total_deaths_per_million",
        "new_cases_smoothed",
        "new_deaths_smoothed",
        "new_deaths_per_million",
        "new_cases_per_million",
        "new_cases_smoothed_per_million",
        "new_deaths_smoothed_per_million",
        "new_tests_smoothed_per_thousand",
        "people_fully_vaccinated",
        "new_vaccinations_smoothed_per_million",
        "stringency_index",
        "new_vaccinations_smoothed_per_million",
    ],
)
df[["stringency_index"]] = df[["stringency_index"]].shift(14)
df = df.groupby("iso_code").rolling(window=14).mean().reset_index().set_index("date")
df.to_csv("./clean/COVID/cases_deaths.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

*** Stringency 


#+BEGIN_SRC python
df = pd.read_csv(
    "https://raw.githubusercontent.com/OxCGRT/covid-policy-tracker/master/data/OxCGRT_latest.csv",
    index_col="Date",
    parse_dates=True,
    usecols=[  # subseting
        "Date",
        "CountryCode",
        "C1_School closing",
        "C1_Flag",
        "C2_Workplace closing",
        "C2_Flag",
        "C3_Cancel public events",
        "C3_Flag",
        "C4_Restrictions on gatherings",
        "C4_Flag",
        "C5_Close public transport",
        "C5_Flag",
        "C6_Stay at home requirements",
        "C6_Flag",
        "C7_Restrictions on internal movement",
        "C7_Flag",
        "C8_International travel controls",
    ],
)

closure = [
    "C1_School closing",
    "C2_Workplace closing",
    "C3_Cancel public events",
    "C4_Restrictions on gatherings",
    "C5_Close public transport",
    "C6_Stay at home requirements",
    "C7_Restrictions on internal movement",
    "C8_International travel controls",
]

flags = [
    "C1_Flag",
    "C2_Flag",
    "C3_Flag",
    "C4_Flag",
    "C5_Flag",
    "C6_Flag",
    "C7_Flag",
]

df["Closure"] = (
    df.reset_index().set_index("CountryCode")[closure].mean(axis="columns").values
)
# df = df[df["Closure"].diff() != 0]
df["Restrict"] = [i > 0 for i in df["Closure"].diff() > 0]
df["Stay_at_home"] = [i == 3 for i in df["C6_Stay at home requirements"]]
df["Stay_at_home_federal"] = df["Stay_at_home"] * df["C6_Flag"]
df["Stay_at_home_federal"] = [i == 1 for i in df["Stay_at_home_federal"]]
df = df[
    ["CountryCode", "Closure", "Restrict", "Stay_at_home", "Stay_at_home_federal"]
    + closure
    + flags
]

short_closure = ["C" + str(i) for i in range(1, len(closure) + 1)]

df.columns = (
    [
        "iso_code",
        "Closure",
        "Restrict",
        "Stay_at_home",
        "Stay_at_home_federal",
    ]
    + short_closure
    + flags
)
df.index.name = "date"  # for merging purposes
df.to_csv("./clean/COVID/closes.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

*** Google mobility

#+BEGIN_SRC python
url = "https://www.gstatic.com/covid19/mobility/Global_Mobility_Report.csv"

cols = [
    "country_region",
    "sub_region_1",
    "sub_region_2",
    "metro_area",
    "iso_3166_2_code",
    "census_fips_code",
    "date",
    "retail_and_recreation_percent_change_from_baseline",
    "grocery_and_pharmacy_percent_change_from_baseline",
    "parks_percent_change_from_baseline",
    "transit_stations_percent_change_from_baseline",
    "workplaces_percent_change_from_baseline",
    "residential_percent_change_from_baseline",
]

df = pd.read_csv(
    url,
    usecols=cols,
    parse_dates=True,
    dtype={
        "country_region": str,
        "sub_region_1": str,
        "sub_region_2": str,
        "metro_area": str,
        "iso_3166_2_code": str,
        "census_fips_code": str,
        "date": str,
        "retail_and_recreation_percent_change_from_baseline": np.float64,
        "grocery_and_pharmacy_percent_change_from_baseline": np.float64,
        "parks_percent_change_from_baseline": np.float64,
        "transit_stations_percent_change_from_baseline": np.float64,
        "workplaces_percent_change_from_baseline": np.float64,
        "residential_percent_change_from_baseline": np.float64,
    },
)
# Convert date column to days of the year
# df['date'] = pd.to_datetime(df['date'], format="%Y/%m/%d", utc=True)


# Remove subnational data, keeping only country figures
filter_cols = [
    "sub_region_1",
    "sub_region_2",
    "metro_area",
    "iso_3166_2_code",
    "census_fips_code",
]
df = df[df[filter_cols].isna().all(1)]

# Delete columns
df = df.drop(
    [
        # "country_region",
        "sub_region_1",
        "sub_region_2",
        "metro_area",
        "census_fips_code",
        "iso_3166_2_code",
    ],
    axis="columns",
)


# Standardise country names to OWID country names
df = df.reset_index().set_index("country_region")
df.index = cc.convert(
    names=list(df.index), to="ISO3", not_found=None
)  # To avoid string problems
df = df.reset_index().set_index("date").drop("index", axis="columns")
# Converting the index as date
df.index = pd.to_datetime(df.index)
# Assign new column names
rename_dict = {
    "date": "Date",
    "level_0": "iso_code",
    "retail_and_recreation_percent_change_from_baseline": "Retail & Recreation",
    "grocery_and_pharmacy_percent_change_from_baseline": "Grocery & Pharmacy",
    "parks_percent_change_from_baseline": "Parks",
    "transit_stations_percent_change_from_baseline": "Transit Stations",
    "workplaces_percent_change_from_baseline": "Workplaces",
    "residential_percent_change_from_baseline": "Residential",
}

# Rename columns
df = df.rename(columns=rename_dict)
df["Isolamento"] = df["Residential"].pct_change()
df.to_csv("./clean/COVID/google_mobility.csv")
#+END_SRC

#+RESULTS:
:results:
:end:

** Merging :noexport:


#+begin_src R
df <-read_csv(
  './clean/COVID/cases_deaths.csv',
  guess_max = 3000
)  %>% arrange(iso_code)

# check if full_join or right or left join
tmp <- read_csv(
  './clean/COVID/google_mobility.csv'
)  %>% arrange(iso_code)
df <- df %>% left_join(tmp)

tmp <- read_csv(
  './clean/COVID/closes.csv'
)  %>% arrange(iso_code)
df <- df %>% left_join(tmp)

df <- df %>%
  group_by(iso_code) %>%
  mutate(Policy_change = c(NA, diff(Closure))) %>%
  ungroup() %>%
  mutate(Restrict = Policy_change > 0) %>%
  mutate(stayhome_growth = (Residential/lag(Residential) - 1) * 100) %>%
  mutate(stayhome_growth_7 = (Residential/lag(Residential,7) - 1) * 100) %>%
  mutate(stayhome_growth_14 = (Residential/lag(Residential,14) - 1) * 100) %>%
  mutate(Isolamento_14 = case_when(
     stayhome_growth_14 >= 0 & Stay_at_home == TRUE ~ "Rígido", # Queda da mobilidade junto da imposição
     stayhome_growth_14 > 0 & Policy_change > 0  & Stay_at_home == FALSE ~ "Brando",
     stayhome_growth_14 > 0 & Policy_change <=0 & Stay_at_home == FALSE ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth_14 < 0 ~ "Queda",
           )) %>%
  mutate(Isolamento_Federal = case_when(
     stayhome_growth_14 >= 0 & Stay_at_home_federal == TRUE ~ "Rígido", # Queda da mobilidade junto da imposição
     stayhome_growth_14 > 0 & Policy_change > 0  & Stay_at_home_federal == FALSE ~ "Brando",
     stayhome_growth_14 > 0 & Policy_change <=0 & Stay_at_home_federal == FALSE ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth_14 < 0 ~ "Queda",
           )) %>%
  mutate(Isolamento_14 = as.factor(Isolamento_14)) %>%
  mutate(cases_growth = (new_cases_per_million/lag(new_cases_per_million) - 1) * 100) %>%
  mutate(deaths_growth = (new_deaths_per_million/lag(new_deaths_per_million) - 1) * 100) %>%
  mutate(vaccine_growth = (people_fully_vaccinated/lag(people_fully_vaccinated) - 1) * 100) %>%
  distinct(date, iso_code, .keep_all = TRUE)

write.csv(
  df,
  './clean/COVID/cases_closes_google_merged.csv',
  row.names = FALSE
)
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  total_cases = [32mcol_double()[39m,
  new_cases_smoothed = [32mcol_double()[39m,
  total_deaths = [32mcol_double()[39m,
  new_deaths_smoothed = [32mcol_double()[39m,
  total_cases_per_million = [32mcol_double()[39m,
  new_cases_per_million = [32mcol_double()[39m,
  new_cases_smoothed_per_million = [32mcol_double()[39m,
  total_deaths_per_million = [32mcol_double()[39m,
  new_deaths_per_million = [32mcol_double()[39m,
  new_deaths_smoothed_per_million = [32mcol_double()[39m,
  new_tests_smoothed_per_thousand = [32mcol_double()[39m,
  people_fully_vaccinated = [32mcol_double()[39m,
  new_vaccinations_smoothed_per_million = [32mcol_double()[39m,
  stringency_index = [32mcol_double()[39m
)

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  `Retail & Recreation` = [32mcol_double()[39m,
  `Grocery & Pharmacy` = [32mcol_double()[39m,
  Parks = [32mcol_double()[39m,
  `Transit Stations` = [32mcol_double()[39m,
  Workplaces = [32mcol_double()[39m,
  Residential = [32mcol_double()[39m,
  Isolamento = [32mcol_double()[39m
)
Joining, by = c("date", "iso_code")

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  .default = col_double(),
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  Restrict = [33mcol_logical()[39m,
  Stay_at_home = [33mcol_logical()[39m,
  Stay_at_home_federal = [33mcol_logical()[39m
)
[36mℹ[39m Use [30m[47m[30m[47m`spec()`[47m[30m[49m[39m for the full column specifications.
Joining, by = c("date", "iso_code")
:end:

** Adaptando dataframe :noexport:

#+begin_src R
df <- read_csv(
  "./clean/COVID/cases_closes_google_merged.csv",
  guess_max = 3000
) %>%
  mutate(Isolamento_14 = factor(Isolamento_14, levels = c("Rígido", "Brando", "Voluntário", "Queda", NA))) %>%
  select(
    date,
    iso_code,
    new_cases_per_million,
    new_cases_smoothed_per_million,
    new_deaths_smoothed_per_million,
    cases_growth,
    deaths_growth,
    vaccine_growth,
    Policy_change,
    Restrict,
    Isolamento_14,
    Residential,
    Closure,
    stayhome_growth,
    stayhome_growth_7,
    stayhome_growth_14,
    vaccine_growth,
    total_deaths,
    Stay_at_home,
    Stay_at_home_federal,
    C1, C2, C6,
    C1_Flag, C2_Flag, C6_Flag,
    total_deaths_per_million,
    total_cases_per_million
  ) %>%
  mutate(cases_growth_after14 = lead(cases_growth, 14)) %>%
  filter(
    ## date > as.Date("2020-02-01"), # same start date for all
    cases_growth < 10, # Removing outliers
    cases_growth > -10,
    ## cases_growth_after14 > -10,
    ## cases_growth_after14<10,
    ## stayhome_growth_7<100,
    total_deaths >= 5
  ) %>%
  ## drop_na(Isolamento, Isolamento_7, Isolamento_14, cases_growth, Policy_change) %>%
  filter(iso_code %in% c(
    "ARG",
    ## "AUS",
    ## "BEL",
    "BOL",
    "BRA",
    ## "CAN",
    ## "CHE",
    "CHL",
    "COL",
    ## "DEU",
    ## "DNK",
    "ECU",
    ## "ESP",
    ## "FIN",
    ## "FRA",
    "GBR",
    ## "IND",
    ## "IRL",
    "ISR",
    ## "ITA",
    ## "JPN",
    ## "KOR",
    ## "MEX",
    ## "NDL",
    ## "NOR",
    ## "NZL",
    "PRT",
    "PRY",
    ## "RUS",
    "SWE",
    "URY",
    "USA",
    "VEN"
    ## "ZAF"
  )) %>%
  mutate(iso_code = as.factor(iso_code)) %>%
  mutate(Policy = case_when(
    Policy_change > 0 ~ "Restrição",
    Policy_change < 0 ~ "Flexibilização",
    Policy_change == 0 ~ "Sem mudanças"
  )) %>%
  mutate(Policy = as.factor(Policy)) %>%
  mutate(cases_rolling_14 = zoo::rollapply(cases_growth, width = 14, FUN = mean, fill = NA)) %>%
  mutate(cum_negative_day = zoo::rollapply(cases_rolling_14 < 0, width = 14, FUN = sum, fill = NA))

ylab <- "Taxa de crescimento de casos"
w <- 14 * 2
th_new_cases <- 100
th_total_deaths <- 100

df <- df %>%
  mutate(y.max = zoo::rollapply(new_cases_smoothed_per_million, 2 * w + 1, max, fill = NA, align = "center")) %>%
  mutate(delta = y.max - new_cases_smoothed_per_million) %>%
  mutate(Pico = new_cases_smoothed_per_million >= th_new_cases & delta <= 0) %>%
  group_by(iso_code) %>%
  fill(Pico, .direction = "up") %>%
  mutate(nPico = cumsum(Pico)) %>%
  ungroup() %>%
  mutate(Onda = case_when(
    total_deaths >= th_total_deaths & nPico == 0 ~ "Início ao 1o pico",
    total_deaths >= th_total_deaths & nPico == 1 ~ "1o ao 2o Pico",
    total_deaths >= th_total_deaths & nPico >= 2 ~ "pós 2o pico"
  )) %>%
  mutate(Onda = factor(Onda)) %>%
  fill(Onda) %>%
  fill(Onda, .direction = "up") %>%
  mutate(Onda = fct_relevel(Onda, "Início ao 1o pico", "1o ao 2o Pico", "pós 2o pico")) %>%
  group_by(iso_code) %>%
  mutate(Strigency_type = case_when(
    Closure <= quantile(Closure, 0.25, na.rm = TRUE) ~ "Low",
    Closure >= quantile(Closure, 0.75, na.rm = TRUE) ~ "High",
    Closure < quantile(Closure, 0.75, na.rm = TRUE)  & Closure > quantile(Closure, 0.25, na.rm = TRUE) ~ "Medium",
  )) %>%
  ## mutate(Strigency_type = as.factor(Strigency_type)) %>%
  ungroup()

write.csv(
  df,
  "./clean/COVID/casos_TipoIsolamento_Onda.csv",
  row.names = FALSE
)

## for(iso in df$iso_code %>% unique() %>% as.character()){
##   df %>%
##     filter(iso_code == iso) %>%
##     data.frame() %>%
##     write.xlsx(
##       './clean/COVID/boxplots/data.xlsx',
##       sheetName = iso,
##       row.names = FALSE,
##       append = TRUE
##     )
## }

## df %>%
##   group_by(iso_code) %>%
##   do(write.csv(
##     . %>% data.frame(),
##     paste0('./clean/COVID/boxplots/', unique(.$iso_code), ".csv"),
##     row.names=FALSE
##   ))
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  .default = col_double(),
  date = [34mcol_date(format = "")[39m,
  iso_code = [31mcol_character()[39m,
  Restrict = [33mcol_logical()[39m,
  Stay_at_home = [33mcol_logical()[39m,
  Stay_at_home_federal = [33mcol_logical()[39m,
  Isolamento_14 = [31mcol_character()[39m,
  Isolamento_Federal = [31mcol_character()[39m
)
[36mℹ[39m Use [30m[47m[30m[47m`spec()`[47m[30m[49m[39m for the full column specifications.
:end:



** Novos casos por milhão x Fase pandemia (sem aparar dados)
#+begin_src R :results value file :var figname="Casos_Policy_Todos" :eval no

name = paste0('./figs/COVID/', figname, ".pdf")

df %>%
  ## filter(
  ##   ## Policy_change != 0,
  ##   new_cases_per_million > 10
  ## ) %>%
  ## drop_na(Policy_change, Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") +
  geom_boxplot(outlier.shape = NA, outlier.color=NA, outlier.alpha=1) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) +
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_Todos.pdf]]
:end:


** Novos casos por milhão x Fase pandemia (mais de 10 casos por milhão de habitante)

#+begin_src R :results value file :var figname="Casos_Policy_10_Todos" :eval no

name = paste0('./figs/COVID/', figname, ".pdf")
    
df %>%
  filter(
    ## Policy_change != 0,
    new_cases_per_million > 10
  ) %>%
  drop_na(Policy_change, Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") + 

  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) + 
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) + 
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_10_Todos.pdf]]
:end:

:results:
[[file:./figs/COVID/Casos_Policy_10_Todos.pdf]]
** Novos casos por milhão x Fase pandemia (mais de 50 casos por milhão de habitante)

#+begin_src R :results value file :var figname="Casos_Policy_50_Todos" :eval no

name = paste0('./figs/COVID/', figname, ".pdf")
    
df %>%
  filter(
    ## Policy_change != 0,
    new_cases_per_million > 50
  ) %>%
  drop_na(Policy_change, Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") + 

  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) + 
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) + 
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_50_Todos.pdf]]
:end:

** Novos casos por milhão x Fase pandemia (mais de 100 casos por milhão de habitante)

#+begin_src R :results value file :var figname="Casos_Policy_100_Todos" :eval no

name = paste0('./figs/COVID/', figname, ".pdf")

df %>%
  filter(
    ## Policy_change != 0,
    new_cases_per_million > 100
  ) %>%
  drop_na(Policy_change, Onda, cases_growth, Isolamento_14) %>%
  ggplot(aes(y=Onda, x= cases_growth, fill=Isolamento_14)) +
  geom_vline(xintercept=0, color="black") +

  geom_boxplot(outlier.shape = NA) +
  labs(
    y = "Fase da Pandemia",
    x = ylab
  ) +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) +
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~iso_code) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Casos_Policy_100_Todos.pdf]]
:end:


* Mobilidade e políticas implementadas

#+begin_src R  :results value file :exports results
countries <- c(
  "USA",
  "SWE",
  "ARG",
  "BRA",
  "PRY",
  "URY",
  "VEN",
  "PRT",
  "GBR"
) 

policy <-"C6"
policy_name <- "Ficar em casa"
width <- 7
library(RColorBrewer)
myColors <- brewer.pal(5,"Set1")

df <- read_csv(
  "./clean/COVID/casos_TipoIsolamento_Onda.csv",
  guess_max = 3000
) %>%
  select(date, iso_code, Residential, C1, C1_Flag, C2, C2_Flag, C6, C6_Flag, Pico, new_cases_per_million) %>%
  mutate(C6 = case_when(
           C6 == 0 ~ "Sem restrição",
           C6 == 1 ~ "Recomendado ficar\nem casa",
           C6 == 2 ~ "Proibido sair\n(Salvo exceções)",
           C6 == 3 ~ "Proibido sair"),
    C6 = fct_relevel(C6, "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair"))

names(myColors) <- levels(df$C6)


  
for(country in countries){
    
name <-paste0("./figs/COVID/Mobilidade_Policy_", country, "_", policy, ".pdf")
tmp <- df %>%  filter(iso_code == country) %>%
  mutate(Residential=zoo::rollapply(
           Residential,
           width,
           mean,
           align='right',fill=NA))

df_inf <- tmp %>%
  group_by(iso_code) %>%
  summarise(vline = date[Pico==1]) %>%
  ungroup()
  
p1 <- tmp %>% ggplot(aes(x = date, y = Residential, color = new_cases_per_million)) +
  geom_line( size = 1.25 ) +
  guides(
    color = guide_colorbar(reverse = TRUE)) +
  scale_color_continuous(name = "Novos casos\npor milhão", high = "#132B43", low = "#56B1F7") +
  geom_vline(
    data = df_inf,
    mapping = aes(xintercept = vline),
    color = "black"
  ) +
  labs(
    y = "Tempo em casa (Semana Móvel)",
    x = "",
    title = country
  ) +
  ylim(0, 27.5)

tmp %>%
  select(date, C6, C6_Flag) %>%
  pivot_longer(C6, names_to = "Policy", values_to = "Measure") %>%
  mutate(Policy = 1) %>%
  pivot_wider(values_from = Policy, values_fill = NA, names_from = Measure) %>%
  pivot_longer(!c(date, C6_Flag), values_to = "Measure") ->tmp_long
  
p2 <- tmp_long %>%  ggplot(aes(x = date, y = Measure, color=name) ) +
  geom_line(aes(size=factor(C6_Flag))) +
  scale_y_discrete(labels = abbreviate) +
  scale_color_manual(values=myColors, name=policy_name) +
  scale_size_discrete(name = "Abrangência", labels = c("Focalizado", "Federal"), limits = c("0","1")) +
  theme_minimal() +
  theme(
    legend.position = "right",
    axis.line.x = element_line(size = 0.5, linetype = "solid", colour = "black"),
    axis.ticks.x = element_line(size = 0.5, linetype = "solid", colour = "black"),
     axis.title.x = element_blank(),
    axis.text.y = element_blank()
    ) +
  labs(
    y = "",
    x = ""
  )

legend_1 <- get_legend(
  # create some space to the left of the legend
  p1 + theme(legend.box.margin = margin(0, 0, 0, 12))
)
  
legend_2 <- get_legend(
  # create some space to the left of the legend
  p2 + theme(legend.box.margin = margin(0, 0, 0, 12))
)
p2 <- p2 + theme(legend.position="none")  
p1 <- p1 + theme(legend.position="none")  
fig <- cowplot::plot_grid(p1, p2, nrow = 2, rel_heights = c(3,0.5), align="v", axis="lr")
assign(country, fig, envir=.GlobalEnv)
print(name)
ggsave(name, width = 20, height = 20, units = "cm")
}
# arrange the three plots in a single row
prow <- plot_grid(
  ARG,
  BRA,
  PRY,
  URY,
  VEN,
  USA,
  align = 'hv',
  axis = 'lr',
  ## hjust = -1,
  nrow = 2
)

# add the legend to the row we made earlier. Give it one-third of 
# the width of one plot (via rel_widths).

name <- paste0("./figs/COVID/Mobilidade_Policy_", "selected", "_", policy, ".pdf")

legends <- plot_grid(
  legend_1,
  legend_2,
  nrow = 2,
  align = 'hv',
  hjust = -1
)

fig<- plot_grid(
  prow,
  NULL,
  legends,
  rel_widths = c(3, 0.05, .4),
  nrow = 1
  )


fig <- ggdraw(fig) +
   draw_image(logo_file, x = 1.0, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 40, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Mobilidade_Policy_selected_C6.pdf]]
:end:




** Dados de políticas adotdas :noexport:

#+begin_src R
df <-read_csv(
  'https://raw.githubusercontent.com/OxCGRT/Brazil-covid-policy/master/data/OxCGRT_Brazil_latest.csv',
  guess_max = 3000
)  %>%
  select(Date, RegionName, RegionCode, Jurisdiction, `C6_Stay at home requirements`, C6_Flag, C6_Notes) %>%
  rename(C6 = `C6_Stay at home requirements`) %>%
  filter(Jurisdiction == "STATE_WIDE") %>%
  mutate(Date = lubridate::ymd(Date)) %>%
  mutate(
    C6 = case_when(
           C6 == 0 ~ "Sem restrição",
           C6 == 1 ~ "Recomendado ficar\nem casa",
           C6 == 2 ~ "Proibido sair\n(Salvo exceções)",
           C6 == 3 ~ "Proibido sair",
           is.na(C6) ~ "Dados indisponíveis"
      )) %>%
  mutate(C6 = factor(C6)) %>%
  mutate(C6 = fct_relevel(C6, "Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair")) %>%
  mutate(C6_Flag = factor(C6_Flag)) %>%
  arrange(RegionName, Date) %>%
  select(-c(Jurisdiction, C6_Notes)) %>%
  rowwise() %>%  mutate(RegionCode = strsplit(RegionCode, split="_")[[1]][2]) %>%
  rename(Estado = RegionName, Sigla = RegionCode, date = Date) %>%
  mutate(Estado = factor(Estado), Sigla = factor(Sigla))



write.csv(
  df,
  './clean/COVID/Estados/Medidas_Estados_Brasil.csv',
  row.names = FALSE
)

df %>%  pivot_longer(C6, names_to = "Policy", values_to = "Measure") %>%
  mutate(Policy = 1) %>%
  pivot_wider(values_from = Policy, values_fill = NA, names_from = Measure) %>%
  pivot_longer(!c(date, C6_Flag, Estado, Sigla), values_to = "Measure") %>%
  mutate(name = factor(name)) -> df_long

write.csv(
  df_long,
  './clean/COVID/Estados/Medidas_Estados_Brasil_Long.csv',
  row.names = FALSE
)
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  .default = col_double(),
  CountryName = [31mcol_character()[39m,
  CountryCode = [31mcol_character()[39m,
  RegionName = [31mcol_character()[39m,
  RegionCode = [31mcol_character()[39m,
  CityName = [31mcol_character()[39m,
  CityCode = [31mcol_character()[39m,
  Jurisdiction = [31mcol_character()[39m,
  C1_Notes = [31mcol_character()[39m,
  C2_Notes = [31mcol_character()[39m,
  C3_Notes = [31mcol_character()[39m,
  C4_Notes = [31mcol_character()[39m,
  C5_Notes = [31mcol_character()[39m,
  C6_Notes = [31mcol_character()[39m,
  C7_Notes = [31mcol_character()[39m,
  C8_Notes = [31mcol_character()[39m,
  E1_Notes = [31mcol_character()[39m,
  E2_Notes = [31mcol_character()[39m,
  E3_Notes = [31mcol_character()[39m,
  E4_Notes = [31mcol_character()[39m,
  H1_Notes = [31mcol_character()[39m
  # ... with 9 more columns
)
[36mℹ[39m Use [30m[47m[30m[47m`spec()`[47m[30m[49m[39m for the full column specifications.
:end:

** Dados de mobilidade :noexport:

#+begin_src R
df <- data.table::fread(
    './raw/Covid/Google_Mobility.csv',
    select = c(
        "date",
        "country_region_code",
        "sub_region_1",
        "sub_region_2",
        "residential_percent_change_from_baseline",
        "iso_3166_2_code"
    ),
    na.strings="",
    data.table = FALSE,
    strip.white = TRUE,
    stringsAsFactors = FALSE, 
    fill = TRUE,
    sep= ","
) %>%
  filter(country_region_code == "BR") %>%
  drop_na(sub_region_1) %>%
  filter(is.na(sub_region_2)) %>%
  select(date, iso_3166_2_code, residential_percent_change_from_baseline) %>%
  rename(Sigla = iso_3166_2_code, Residential = residential_percent_change_from_baseline) %>%
  rowwise() %>%  mutate(Sigla = strsplit(Sigla, split="-")[[1]][2]) %>%
  arrange(Sigla, date) %>%
  mutate(Sigla = factor(Sigla))

data.table::fwrite(
              df,
              './clean/COVID/Estados/Mobilidade.csv',
              row.names = FALSE
              )
    
#+end_src

#+RESULTS:
:results:
:end:





** Dados de casos :noexport:

#+begin_src R

df <- data.table::fread(
    './raw/Covid/Casos_Brasilio.csv') %>%
  filter(place_type == "state") %>%
  select(date,
         state,
         new_confirmed,
         new_deaths,
         estimated_population,
         last_available_confirmed_per_100k_inhabitants
         ) %>%
  arrange(state, date) %>%
  rename(
    Sigla = state,
    new_cases = new_confirmed,
    total_cases_per_million = last_available_confirmed_per_100k_inhabitants,
    Populacao = estimated_population
    ) %>%
  mutate(Sigla = factor(Sigla))


data.table::fwrite(
              df,
              './clean/COVID/Estados/Casos.csv',
              row.names = FALSE
              )
    
#+end_src

#+RESULTS:
:results:
:end:

** Unindo dataframes :noexport:

#+begin_src R
after <- 3

df <-read_csv(
  './clean/COVID/Estados/Medidas_Estados_Brasil.csv',
  guess_max = 3000
) 

# check if full_join or right or left join
tmp <- read_csv(
  './clean/COVID/Estados/Mobilidade.csv',
)
df <- df %>% left_join(tmp)

tmp <- read_csv(
  './clean/COVID/Estados/Casos.csv',
)
df <- df %>% left_join(tmp)

df <- df %>%
  mutate(C6 = factor(C6)) %>%
  mutate(Sigla = factor(Sigla)) %>%
  mutate(Policy_change = c(NA, diff(C6 %>% fct_rev() %>% as.numeric()))) %>%
  mutate(stayhome_growth_14 = (Residential/lag(Residential,14) - 1) * 100) %>%
  mutate(stayhome_growth_after = (lead(Residential, after)/Residential - 1) * 100) %>%
  mutate(Isolamento = case_when(
     stayhome_growth_after >= 0 & C6 == "Algumas exceções\npara sair" |  C6 == "Proibido sair" ~ "Rígido", # Queda da mobilidade junto da imposição
     stayhome_growth_after > 0 & Policy_change > 0  &  C6 == "Recomendado ficar\nem casa" | C6 == "Sem restrição" ~ "Brando",
     stayhome_growth_after > 0 & Policy_change <=0 & C6 != "Proibido sair" ~ "Voluntário", # Queda da mobilidade sem restrição
     stayhome_growth_after < 0 ~ "Queda",
     is.na(stayhome_growth_after) | is.na(Policy_change) ~ "Dados indisponíveis"
           )) %>%
  mutate(Isolamento = factor(Isolamento)) %>%
  mutate(cases_growth = ((new_cases/lag(new_cases)) - 1) * 100) %>%
  mutate(deaths_growth = (new_deaths/lag(new_deaths) - 1) * 100) %>%
  mutate(new_cases_100K = (replace_na(new_cases, 0)/Populacao)*10^5) %>%
  mutate(new_deaths_100K = (replace_na(new_cases, 0)/Populacao)*10^5) %>%
  mutate(new_cases_100K = zoo::rollapply(new_cases_100K, width = 7, FUN = mean, fill = NA)) %>%
  mutate(new_cases_1M = (replace_na(new_cases, 0)/Populacao)*10^6) %>%
  mutate(new_cases_100K = zoo::rollapply(new_cases_100K, width = 7, FUN = mean, fill = NA)) %>%
  mutate(cases_growth_100K = (((new_cases_100K)/lag(new_cases_100K))-1)*100) %>%
  group_by(Sigla) %>%
  mutate(cum_cases_100K = (cumsum(replace_na(new_cases, 0))/Populacao)*10^5) %>%
  mutate(cum_cases_100K = zoo::rollapply(cum_cases_100K, width = 7, FUN = mean, fill = NA)) %>%
  mutate(cum_cases_1M = (cumsum(replace_na(new_cases, 0))/Populacao)*10^6) %>%
  mutate(cum_cases_1M = zoo::rollapply(cum_cases_1M, width = 7, FUN = mean, fill = NA)) %>%
  mutate(cum_deaths_100K = (cumsum(replace_na(new_deaths, 0))/Populacao)*10^5) %>%
  mutate(cum_deaths_100K = zoo::rollapply(cum_deaths_100K, width = 7, FUN = mean, fill = NA)) %>%
  ungroup()

w <- 14 * 3
th_new_cases <- 100 * 3
th_total_deaths <- 100
th_cases_100 <- 12.5

df <- df %>%
  group_by(Sigla) %>%
  mutate(total_deaths = cumsum(replace_na(new_deaths, 0))) %>%
  ungroup() %>%
  mutate(tmp = zoo::rollapply(new_cases, 7, mean, fill = NA, align = "center")) %>%
  mutate(y.max = zoo::rollapply(tmp, 2 * w + 1, max, fill = NA, align = "center")) %>%
  mutate(delta = y.max - tmp) %>%
  mutate(Pico = new_cases_100K >= th_cases_100 & delta <= 0) %>%
  group_by(Sigla) %>%
  fill(Pico, .direction = "up") %>%
  mutate(nPico = cumsum(Pico)) %>%
  ungroup() %>%
  mutate(Onda = case_when(
    total_deaths >= th_total_deaths & nPico == 0 ~ "Início ao 1o pico",
    total_deaths >= th_total_deaths & nPico == 1 ~ "1o ao 2o Pico",
    total_deaths >= th_total_deaths & nPico >= 2 ~ "pós 2o pico"
  )) %>%
  mutate(Onda = factor(Onda)) %>%
  fill(Onda) %>%
  fill(Onda, .direction = "up") %>%
  mutate(Onda = fct_relevel(Onda, "Início ao 1o pico", "1o ao 2o Pico", "pós 2o pico"))
  
write.csv(
  df,
  './clean/COVID/Estados/Merged_wide.csv',
  row.names = FALSE
)
#+end_src

#+RESULTS:
:results:

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  Estado = [31mcol_character()[39m,
  Sigla = [31mcol_character()[39m,
  C6 = [31mcol_character()[39m,
  C6_Flag = [32mcol_double()[39m
)

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  Sigla = [31mcol_character()[39m,
  Residential = [32mcol_double()[39m
)
Joining, by = c("date", "Sigla")

[36m──[39m [1m[1mColumn specification[1m[22m [36m───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────[39m
cols(
  date = [34mcol_date(format = "")[39m,
  Sigla = [31mcol_character()[39m,
  new_cases = [32mcol_double()[39m,
  new_deaths = [32mcol_double()[39m,
  Populacao = [32mcol_double()[39m,
  total_cases_per_million = [32mcol_double()[39m
)
Joining, by = c("date", "Sigla")
:end:

** Número de casos por estados

#+begin_src R :results value file :exports file :var figname="Casos"

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6 = factor(C6),
         C6 = fct_relevel(C6, "Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair")) %>%
  mutate(Estado = factor(Estado)) %>%
  group_by(Sigla)

name = paste0('./figs/COVID/Estados/', figname, ".pdf")

df_inf <- df %>%
  group_by(Estado) %>%
  summarise(vline = date[Pico==1])

df %>% ggplot(aes(x=date)) +
  geom_line(aes(y=new_cases_100K), color="red") +
  geom_vline(
    data = df_inf,
    mapping = aes(xintercept = vline),
    color = "black"
  ) +
  labs(
    y = "Novos casos por\n100 mil habitantes",
    x = ""
  ) +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
  scale_x_date(date_breaks = "2 months", date_minor_breaks = "2 weeks", date_labels = "%b/%y") +
  guides(fill=guide_legend(title="Estados Brasileiros")) +
      theme(
        axis.text.y.left = element_text(size = 14),
        axis.text.x = element_text(size = 12),
        axis.title.y.left = element_text(size = 14),
        strip.text = element_text( size = 12, face = "bold" )
      ) +
  facet_wrap(~Estado) ->fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.95, y = 0.15, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 40, height = 30, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Casos.pdf]]
:end:

** Número de mortes por estados

#+begin_src R :results value file :exports file :var figname="Mortes"

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6 = factor(C6),
         C6 = fct_relevel(C6, "Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair")) %>%
  mutate(Estado = factor(Estado)) %>%
  group_by(Sigla)

name = paste0('./figs/COVID/Estados/', figname, ".pdf")

df_inf <- df %>%
  group_by(Estado) %>%
  summarise(vline = date[Pico==1])

df %>% ggplot(aes(x=date)) +
  geom_line(aes(
    y=zoo::rollapply(new_deaths_100K, 14, mean, align='right',fill=NA)
    ), color="red") +
  ## geom_vline(
  ##   data = df_inf,
  ##   mapping = aes(xintercept = vline),
  ##   color = "black"
  ## ) +
  labs(
    y = "Novas mortes por 100 mil habitantes",
    x = ""
  ) +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
  scale_x_date(date_breaks = "2 months", date_minor_breaks = "2 weeks", date_labels = "%b/%y") +
  guides(fill=guide_legend(title="Estados Brasileiros")) +
      theme(
        axis.text.y.left = element_text(size = 14),
        axis.text.x = element_text(size = 12),
        axis.title.y.left = element_text(size = 14),
        strip.text = element_text( size = 12, face = "bold" )
      ) +
  facet_wrap(~Estado) ->fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.95, y = 0.15, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 40, height = 30, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Mortes.pdf]]
:end:

** Número de casos acumulados por estados

#+begin_src R :results value file :exports file :var figname="Casos_Cum"

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6 = factor(C6),
         C6 = fct_relevel(C6, "Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair")) %>%
  mutate(Estado = factor(Estado)) %>%
  group_by(Sigla)

name = paste0('./figs/COVID/Estados/', figname, ".pdf")

df_inf <- df %>%
  group_by(Estado) %>%
  summarise(vline = date[Pico==1])

df %>% ggplot(aes(x=date)) +
  geom_line(aes(y=cum_cases_100K), color="red") +
  ## geom_vline(
  ##   data = df_inf,
  ##   mapping = aes(xintercept = vline),
  ##   color = "black"
  ## ) +
  labs(
    y = "Casos acumulados por\n100 mil habitantes",
    x = ""
  ) +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
  scale_x_date(date_breaks = "2 months", date_minor_breaks = "2 weeks", date_labels = "%b/%y") +
  guides(fill=guide_legend(title="Estados Brasileiros")) +
      theme(
        axis.text.y.left = element_text(size = 14),
        axis.text.x = element_text(size = 12),
        axis.title.y.left = element_text(size = 14),
        strip.text = element_text( size = 12, face = "bold" )
      ) +
  facet_wrap(~Estado) ->fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.95, y = 0.15, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 40, height = 30, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Casos_Cum.pdf]]
:end:

** Número de mortes acumuadas por estados

#+begin_src R :results value file :exports file :var figname="Mortes_Cum"

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6 = factor(C6),
         C6 = fct_relevel(C6, "Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair")) %>%
  mutate(Estado = factor(Estado)) %>%
  group_by(Sigla)

name = paste0('./figs/COVID/Estados/', figname, ".pdf")

df_inf <- df %>%
  group_by(Estado) %>%
  summarise(vline = date[Pico==1])

df %>% ggplot(aes(x=date)) +
  geom_line(aes(y=cum_cases_100K), color="red") +
  ## geom_vline(
  ##   data = df_inf,
  ##   mapping = aes(xintercept = vline),
  ##   color = "black"
  ## ) +
  labs(
    y = "Mortes acumulados por 100 mil habitantes",
    x = ""
  ) +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
  scale_x_date(date_breaks = "2 months", date_minor_breaks = "2 weeks", date_labels = "%b/%y") +
  guides(fill=guide_legend(title="Estados Brasileiros")) +
      theme(
        axis.text.y.left = element_text(size = 14),
        axis.text.x = element_text(size = 12),
        axis.title.y.left = element_text(size = 14),
        strip.text = element_text( size = 12, face = "bold" )
      ) +
  facet_wrap(~Estado) ->fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.95, y = 0.15, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 40, height = 30, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Mortes_Cum.pdf]]
:end:

** Novos casos e mortes - Brasil


#+begin_src R :results value file :var figname="Brasil"

name = paste0('./figs/COVID/Estados/', figname, ".pdf")


df <- read_csv(
  "./clean/COVID/casos_TipoIsolamento_Onda.csv",
  guess_max = 3000
) %>% filter(iso_code == "BRA")


rescale = max(df$new_deaths_smoothed_per_million)/max(df$new_cases_smoothed_per_million)
    
# https://stackoverflow.com/questions/10942360/how-to-get-geom-vline-to-honor-facet-wrap
df_inf <- df %>% 
  summarise(vline = date[Pico==1])


df %>% ggplot(aes(x=date)) +
  ## geom_line(aes(y=new_cases_smoothed_per_million), color="black", linetype="dashed") + 
  geom_line(aes(y=new_cases_smoothed_per_million), color="blue") +
  geom_line(aes(y=new_deaths_smoothed_per_million/rescale), color="red") +
  geom_vline(
    data = df_inf, 
    mapping = aes(xintercept = vline),
    color = "black"
  ) +
  labs(
    x = ""
  ) +
      scale_y_continuous(
        name = "Novos casos por milhão de habitantes",
        sec.axis = sec_axis( trans=~.*rescale, name="Novos mortes por milhão de habitantes")
      ) +
      theme(
        axis.line.y.right = element_line(color = "red"), 
        axis.ticks.y.right = element_line(color = "red"),
        axis.line.y.left = element_line(color = "blue"), 
        axis.ticks.y.left = element_line(color = "blue"),
        axis.text.y.right = element_text(size = 18),
        axis.text.y.left = element_text(size = 18),
        axis.text.x = element_text(size = 18),
        axis.title.y.left = element_text(size = 18),
        axis.title.y.right = element_text(size = 18)
      ) +
  scale_x_date(date_breaks = "1 month", date_minor_breaks = "2 weeks", date_labels = "%b/%y") +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) ->fig


 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.35, y = 0.95, hjust = 1, vjust = 1, width = 0.25, height = 0.2)
ggsave(name, width = 40, height = 30, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Brasil.pdf]]
:end:

** Boxplots de taxa de crescimento e tipo de isolamento

#+begin_src R :results value file :var figname="Boxplot_Isolamento"

name = paste0('./figs/COVID/Estados/', figname, ".pdf")

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6 = factor(C6)) %>%
  mutate(Isolamento_14 = factor(Isolamento)) %>%
  mutate(Sigla = factor(Sigla)) %>%
  mutate(Onda = fct_relevel(Onda, "Início ao 1o pico", "1o ao 2o Pico", "pós 2o pico"))

df %>%
  filter(
    cases_growth < 10,
    cases_growth > -10,
    cases_growth_100K <10,
    cases_growth_100K > -10
  ) %>%
  drop_na(Policy_change, Onda, cases_growth, Isolamento) %>%
  ggplot(aes(y=Onda, x= cases_growth_100K, fill=Isolamento)) +
  geom_vline(xintercept=0, color="black") +
  geom_boxplot(outlier.shape = NA, outlier.color=NA, outlier.alpha=1) +
  labs(
    y = "Fase da Pandemia",
    x = "Tx. novos casos por 100 mil habitantes"
  ) +
  scale_fill_manual(
      values=c("#ffffff", "#23AE00", "#FFCE14", "#CA0014", "#0700A3"),
      breaks=c("Dados indisponíveis", "Queda", "Brando", "Rígido", "Voluntário"),
      name="Tipo de isolamento") +
  ## scale_fill_manual(values=c("#FF0000", "#00FF00","#0000FF")) +
  coord_flip() +
  theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
 guides(fill=guide_legend(title="Tipo de isolamento")) +
 facet_wrap(~Sigla) -> fig

 fig <- ggdraw(fig) +
   draw_image(logo_file, x = 0.975, y = .975, hjust = 1, vjust = 1, width = 0.15, height = 0.1)
ggsave(name, width = 20, height = 20, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Boxplot_Isolamento.pdf]]
:end:

** Gráficos de mobilidade e política por estados para indicar quando houve medida adotada

#+begin_src R  :results value file :exports results
policy <-"C6"
policy_name <- "Ficar em casa"
width <- 7
library(RColorBrewer)
myColors <- brewer.pal(5,"Set1")

df <- read_csv(
  "./clean/COVID/Estados/Merged_wide.csv",
  guess_max = 3000
) %>%
  mutate(C6_num = case_when(
           ## C6 == "Dados indisponíveis" ~ NA_integer_,
           C6 == "Sem restrição" ~ 0,
           C6 == "Recomendado ficar\nem casa" ~ 1,
           C6 == "Proibido sair\n(Salvo exceções)" ~ 2,
           C6 == "Proibido sair" ~ 3
         )) %>%
  mutate(Restrict = diff(c(NA, C6_num))) %>%
  mutate(Estado = factor(Estado)) %>%
  group_by(Sigla) %>%
  mutate(Residential=zoo::rollapply(
                              Residential,
                              width,
                              mean,
                              align='right',fill=NA)) %>%
  ungroup() %>%
  filter(Residential > -2)

estados <- df$Sigla %>% unique()



names(myColors) <- levels(df$C6)
lefts <- c(
  "AC",
  "AP",
  "DF",
  "MA",
  "MT",
  "PE",
  "RJ",
  "RR",
  "SE"
)

rights <- c(
  "AM",
  "CE",
  "GO",
  "MS",
  "PB",
  "PR",
  "RO",
  "SC",
  "TO"
)

plots <- c()

for(estado in estados){

  tmp <- df %>%  filter(Sigla == estado)

  df_inf <- tmp %>%
    group_by(Sigla) %>%
    summarise(vline = date[Restrict>0]) %>%
    ungroup()

  rescale <- ((replace_na(tmp$new_cases_100K,0) %>% max())/(replace_na(tmp$Residential, 0) %>% max()))  %>% round()
                                        # color = new_cases não tem legenda adequada
  p1 <- tmp %>% ggplot(aes(x = date, y = Residential, color = "blue")) +
    geom_line( size = 1.25 ) +
    geom_line( aes(x = date, y = new_cases_100K/rescale), color = "red", size = 1.25 ) +
    ## guides(
    ##   color = guide_colorbar(reverse = TRUE)) +
    ## scale_color_continuous(name = "Novos casos", high = "#132B43", low = "#56B1F7") +
    geom_vline(
      data = df_inf,
      mapping = aes(xintercept = vline),
      color = "black"
    ) +
    geom_vline(
      data = df,
      mapping = aes(xintercept = "2020-03-24" %>% as.Date() %>% as.numeric()),
      color = "red",
      linetype="dashed"
    ) +
    ylim(0, 27.5) +
    scale_x_date(date_breaks = "2 months", date_minor_breaks = "2 weeks", date_labels = "%b/%y")

  if(estado %in% rights){
    p1 <-p1 + labs(
                ## y = "Tempo em casa",
                x = "",
                title = tmp$Estado %>% unique()
              ) +
                                        # Custom the Y scales:
      scale_y_continuous(
        name = "",
        sec.axis = sec_axis( trans=~.*rescale, name="Novos casos / 100 mil hab")
      ) +
      theme(
        axis.line.y.right = element_line(color = "red"),
        axis.ticks.y.right = element_line(color = "red"),
        axis.line.y.left = element_line(color = "blue"),
        axis.ticks.y.left = element_line(color = "blue")
      )
  } else if(estado %in% lefts){

    p1 <-p1 + labs(
                x = "",
                title = tmp$Estado %>% unique()
              ) +
                                        # Custom the Y scales:
      scale_y_continuous(
        name = "Tempo em casa",
        sec.axis = sec_axis( trans=~.*rescale, name="")
      ) +
      theme(
        axis.line.y.right = element_line(color = "red"),
        axis.ticks.y.right = element_line(color = "red"),
        axis.line.y.left = element_line(color = "blue"),
        axis.ticks.y.left = element_line(color = "blue")
      )
  } else{

    p1 <-p1 + labs(
                x = "",
                title = tmp$Estado %>% unique()
              ) +
                                        # Custom the Y scales:
      scale_y_continuous(
        name = "",
        sec.axis = sec_axis( trans=~.*rescale, name="")
      ) +
      theme(
        axis.line.y.right = element_line(color = "red"),
        axis.ticks.y.right = element_line(color = "red"),
        axis.line.y.left = element_line(color = "blue"),
        axis.ticks.y.left = element_line(color = "blue")
      )
  }


  tmp %>%
    select(date, C6, C6_Flag) %>%
    pivot_longer(C6, names_to = "Policy", values_to = "Measure") %>%
    mutate(Policy = 1) %>%
    pivot_wider(values_from = Policy, values_fill = NA, names_from = Measure) %>%
    pivot_longer(!c(date, C6_Flag), values_to = "Measure") ->tmp_long

  p2 <- tmp_long %>%
    mutate(C6_Flag = case_when(
             C6_Flag == 1 ~ "Estadual",
             C6_Flag == 0 ~ "Local",
             is.na(C6_Flag) ~ "Sem dados"
           )) %>%
    mutate(C6_Flag = C6_Flag %>% factor() %>% fct_rev()) %>%
    rename(Cobertura = C6_Flag) %>%
    ggplot(aes(x = date, y = Measure, color=name) ) +
    ## geom_line(aes(size=1)) +
    geom_line(aes(size = Cobertura)) +
    scale_y_discrete(labels = abbreviate) +
    scale_color_manual(
      values=c("#575757", "#23AE00", "#FFCE14", "#FF7319", "#CA0014"),
      breaks=c("Dados indisponíveis", "Sem restrição", "Recomendado ficar\nem casa", "Proibido sair\n(Salvo exceções)", "Proibido sair"),
      name=policy_name) +
    theme_minimal() +
    theme(
      legend.position = "right",
      axis.line.x = element_line(size = 0.5, linetype = "solid", colour = "black"),
      axis.ticks.x = element_line(size = 0.5, linetype = "solid", colour = "black"),
      axis.title.x = element_blank(),
      axis.text.y = element_blank()
    ) +
    labs(
      y = "",
      x = ""
    )


  ## legend_1 <- get_legend(
  ##                                       # create some space to the left of the legend
  ##   p1 + theme(legend.box.margin = margin(0, 0, 0, 12))
  ## )
  if(estado == "RO"){
    legend_2 <- get_legend(
                                        # create some space to the left of the legend
      p2 + theme(legend.box.margin = margin(0, 0, 0, 12)) + guides(colour = guide_legend(override.aes = list(size=3)))
    )
  }
  p2 <- p2 + theme(legend.position="none")
  p1 <- p1 + theme(legend.position="none")
  fig <- cowplot::plot_grid(
                    p1 + theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)),
                    p2 + theme(plot.margin = margin(t=-1.1, b=1., unit="cm"), axis.text.x = element_blank()) + theme(panel.grid.major = element_blank(), panel.grid.minor = element_blank(), panel.background = element_blank()),
                    nrow = 2,
                    rel_heights = c(3,0.5),
                    align="v",
                    axis="lr"
                  )
  assign(estado, fig, envir=.GlobalEnv)

  plots <- c(plots, estado)

}
                                        # arrange the three plots in a single row
prow <- plot_grid(
  AC, AL, AM,
  AP, BA, CE,
  DF, ES, GO,
  MA, MG, MS,
  MT, PA, PB,
  PE, PI, PR,
  RJ, RN, RO,
  RR, RS, SC,
  SE, SP, TO,
  align = 'hv',
  axis = 'lr',
  ## hjust = -1,
  nrow = 9
)

                                        # add the legend to the row we made earlier. Give it one-third of
                                        # the width of one plot (via rel_widths).

name <- paste0("./figs/COVID/Estados/Quando_Policy_", "selected", "_", policy, ".pdf")

## legends <- plot_grid(
##   legend_1,
##   legend_2,
##   nrow = 2,
##   align = 'hv',
##   hjust = -1
## )

legends <-legend_2

fig<- plot_grid(
  prow,
  NULL,
  legends,
  rel_widths = c(3, 0.05, .4),
  nrow = 1
)


fig <- ggdraw(fig) # + draw_image(logo_file, x = 0.999, y = .975, hjust = 1, vjust = 1, width = 0.125, height = 0.1)
ggsave(name, width = 40, height = 64, units = "cm")
print(name)
#+end_src

#+RESULTS:
:results:
[[file:./figs/COVID/Estados/Quando_Policy_selected_C6.pdf]]
:end:
